//
//  Localizable.strings
//  TheBox iOS
//
//  Copyright © 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

// General

"_cancel_"                  = "Peruuta";
"_upload_file_"             = "Lähetä tiedosto";
"_download_file_"           = "Lataa tiedosto";
"_loading_"                 = "Ladataan";
"_loading_with_points_"     = "Ladataan…";
"_loading_num_"             = "Ladataan tiedostoa %i";
"_loading_autoupload_"      = "Automaattinen lähettäminen";
"_uploading_"               = "Lähetetään";
"_synchronization_"         = "Synkronointi";
"_delete_"                  = "Poista";
"_delete_file_n_"           = "Poistetaan tiedostoa %i / %i";
"_rename_"                  = "Nimeä uudelleen";
"_move_"                    = "Siirrä";
"_move_file_n_"             = "Siirretään tiedostoa %i / %i";
"_creating_sharing_"        = "Luodaan jakoa";
"_updating_sharing_"        = "Päivitetään jakoa";
"_removing_sharing_"        = "Poistetaan jakoa";
"_add_"                     = "Lisää";
"_login_"                   = "Kirjaudu";
"_save_"                    = "Tallenna";
"_warning_"                 = "Varoitus";
"_error_"                   = "Virhe";
"_no_"                      = "Ei";
"_yes_"                     = "Kyllä";
"_select_"                  = "Valitse";
"_upload_"                  = "Upload";
"_home_"                    = "Tiedostot";
"_file_to_upload_"          = "Tiedosto lähetettäväksi";
"_destination_"             = "Määränpää";
"_ok_"                      = "OK";
"_beta_version_"            = "Beta-versio";
"_function_in_testing_"     = "Toimintoa testataan, ilmoita meille ongelmista tai virheistä.";
"_done_"                    = "Valmis";
"_passcode_too_short_"      = "Pääsykoodi on liian lyhyt, vähintään 4 merkkiä vaaditaan";
"_selected_"                = "Valittu";
"_scan_fingerprint_"        = "Tunnistaudu sormenjäljelläsi";
"_no_active_account_"       = "Tiliä ei löytynyt";
"_info_"                    = "Tietoa";
"_email_"                   = "Sähköpostiosoite";
"_save_exit_"               = "Haluatko poistua tallentamatta?";
"_video_"                   = "Video";
"_overwrite_"               = "Ylikirjoita";
"_transfers_in_queue_"      = "Siirto käynnissä, odota…";
"_too_errors_automatic_all_"= "Liikaa virheitä, siirry ohjauskeskukseen tarkistaaksesi ongelman";
"_create_folder_"           = "Luo kansio";
"_create_folder_on_"        = "Luo kansio kohteeseen";
"_close_"                   = "Sulje";
"_postpone_"                = "Lykkää";
"_remove_"                  = "Poista";
"_file_not_found_"          = "Tiedostoa ei löytynyt";
"_continue_"                = "Haluatko jatkaa?";
"_auto_upload_folder_"      = "Automaattinen lähetys";
"_gallery_"                 = "Galleria";
"_photo_"                   = "Kuva";
"_audio_"                   = "Ääni";
"_unknown_"                 = "Tuntematon";
"_next_"                    = "Seuraava";
"_success_"                 = "Success";
"_initialization_"          = "Initialization";
"_experimental_"            = "Experimental";

// App

"_network_available_"       = "Verkko saatavilla";
"_network_not_available_"   = "Verkko ei saatavilla";

// Networking

"_no_reuploadfile_"         = "Could not find nor resend file. Delete the upload and reload the file to upload it.";
"_file_already_exists_"     = "Toiminnon suorittaminen ei onnistunut, koska samanniminen tiedosto on jo olemassa";
"_read_file_error_"         = "Lukemisessa tiedostovirhe";

// More

"_more_"                    = "Lisää";
"_notifications_"           = "Ilmoitukset";
"_logout_"                  = "Kirjaudu ulos";

// Settings

"_acknowledgements_"        = "Acknowledgements";
"_settings_"                = "Asetukset";
"_passcode_"                = "Salasana";
"_lock_"                    = "Lock";
"_lock_active_"             = "Lukitus: Käytössä";
"_lock_not_active_"         = "Lukitus: Pois käytöstä";
"_lock_protection_no_screen_"        = "Do not ask at startup";
"_lock_protection_no_screen_footer_" = "Use \"Do not ask at startup\" for protected folders only or for reading the encryption passphrase";
"_url_"                     = "URL-osoite";
"_username_"                = "Käyttäjätunnus";
"_change_credentials_"      = "Muuta tilitietojasi";
"_wifi_only_"               = "Käytä vain Wi-Fi-yhteyttä";
"_settings_autoupload_"     = "Automaattinen lähetys";
"_app_version_"             = "Sovellusversio";
"_app_in_use_"              = "Application in use";
"_contact_by_email_"        = "Ota meihin yhteyttä sähköpostilla";
"_clear_cache_"             = "Clear cache (%@ used)";
"_clear_cache_no_size_"     = "Clear cache";
"_exit_"                    = "Poistu";
"_funct_not_enabled_"       = "Toiminnallisuutta ei ole otettu käyttöön";
"_passcode_activate_"       = "Password lock activated";
"_disabling_passcode_"      = "Disabling password lock";
"_want_exit_"               = "Attention!  Will be reset to initial state. Continue?";
"_proceed_"                 = "Jatka";
"_delete_cache_"            = "Poista välimuisti";
"_want_delete_cache_"       = "Haluatko poistaa välimuistin?";
"_want_delete_thumbnails_"  = "Haluatko poistaa myös kaikki esikatselukuvat?";
"_mail_deleted_"            = "Sähköposti poistettu";
"_mail_saved_"              = "Sähköposti tallennettu";
"_mail_sent_"               = "Sähköposti lähetetty";
"_mail_failure_"            = "Sähköpostin lähettäminen epäonnistui: %@";
"_information_req_"         = "Information request";
"_write_in_english_"        = "Kirjoitathan meille englanniksi";
"_credentials_"             = "Tilitiedot";
"_manage_account_"          = "Tilin hallinta";
"_change_password_"         = "Vaihda salasana";
"_add_account_"             = "Lisää tili";
"_delete_account_"          = "Poista tili";
"_want_delete_"             = "Haluatko varmasti poistaa?";
"_no_delete_"               = "Ei, älä poista";
"_yes_delete_"              = "Kyllä, poista";
"_remove_cache_"            = "Odota, poistetaan välimuistia…";
"_optimizations_"           = "Optimoinnit";
"_synchronizations_"        = "Synkronoidut kansiot";
"_version_server_"          = "Palvelimen versio";
"_help_"                    = "Ohje";
"_lock_protection_simply_"  = "Heikko salasanasuojaus";
"_change_simply_passcode_"  = "Vaihda salasanan tyyppiä";
"_quota_"                   = "Kiintiö";
"_available_"               = "saatavilla";
"_cloud_account_"           = "Pilvitunnus";
"_information_"             = "Tiedot";
"_personal_information_"    = "Henkilökohtaiset tiedot";
"_user_full_name_"          = "Koko nimi";
"_user_address_"            = "Osoite";
"_user_phone_"              = "Puhelinnumero";
"_user_email_"              = "Sähköpostiosoite";
"_user_web_"                = "Verkkosivusto";
"_user_twitter_"            = "Twitter";
"_quota_using_"             = "Käytössäsi on %@/%@";
"_favorite_offline_"        = "Suosikit saatavilla offline";
"_favorite_offline_footer_" = "Making all favorites available offline may take a while and use a lot of memory while doing it.";
"_advanced_"                = "Lisäasetukset";
"Skip"                      = "Ohita";
"Start"                     = "Aloita";

// Manage AutoUpload

"_autoupload_"                      = "Lähetä kuvia/videoita automaattisesti";
"_autoupload_background_"           = "Lähetä automaattisesti taustalla";
"_autoupload_photos_"               = "Lähetä kuvia automaattisesti";
"_autoupload_videos_"               = "Lähetä videoita automaattisesti";
"_autoupload_description_"          = "Uudet kuvat/videot lähetetään pilveesi";
"_autoupload_description_background_"  = "This option requires the use of GPS to trigger the detection of new photos/videos in the camera roll once the location changes significantly";
"_autoupload_background_title_"     = "Rajoitukset";
"_autoupload_background_msg_"       = "iOS-järjestelmän rajoitusten vuoksi toiminnon suorittaminen taustalla ei ole mahdollista, jos sijaintipalvelut eivät ole käytössä. Kun laitteen sijainti muuttuu, järjestelmä herää lyhyeksi ajaksi. Tänä aikana tarkistetaan uudet kuvat ja lähetetään ne pilveen.";
"_autoupload_change_location_"      = "Vaihda kansiota";
"_autoupload_location_now_"         = "Kansio";
"_autoupload_location_default_"     = "Palauta oletuskansio";
"_autoupload_change_location_footer_" = "Change folder used for 'Automatic upload of camera photos' (if the option is enabled)";
"_autoupload_not_select_home_"      = "Valitse kansio";
"_autoupload_save_album_"           = "Kopioi kuva tai video kuva-albumiin";
"_autoupload_fullphotos_"           = "Lähetä koko kameran rulla";
"_autoupload_fullphotos_footer_"    = "Adjust the options above before uploading";
"_autoupload_create_subfolder_"     = "Käytä alikansioita";
"_autoupload_create_subfolder_footer_" = "Tallenna alikansioihin vuoden ja kuukauden mukaisesti";
"_autoupload_filenamemask_"         = "Muuta tiedostojen nimeämiskäytäntöä";
"_autoupload_filenamemask_footer_"  = "Muuta tiedostojen automaattista nimeämiskäytäntöä";
"_autoupload_format_compatibility_" = "Most Compatible";
"_autoupload_format_compatibility_footer_" = "\"Most compatible\" will always save photos as JPEG";

// Manage Help

"_help_tutorial_"               = "Opastuskierros";
"_help_intro_"                  = "TheBox-perehdytys";
"_help_activity_verbose_"       = "Yksityiskohtainen toimintasyöte";
"_help_activity_mail_"          = "Lähetä toimet sähköpostitse";
"_help_activity_clear_"         = "Tyhjennä toimet";


// Manage Advanced

"_optimized_photos_"            = "Optimized photo resolution";
"_upload_del_photos_"           = "Poista tiedostot lähettämisen jälkeen";
"_optimized_photos_how_"        = "If your iPhone is low on space, full-resolution photos are automatically replaced with optimized versions. The full-resolution versions are stored in your cloud.";
"_upload_del_photos_how_"       = "Files will be removed from device memory after they’ve been uploaded to your cloud. They will remain in the camera roll. Just download the files to see them.";
"_show_hidden_files_"           = "Näytä piilotetut tiedostot";

// Login

"_connect_server_anyway_"       = "Haluatko silti yhdistää palvelimeen?";
"_connection_error_"            = "Yhteysvirhe";
"_add_your_nextcloud_"          = "Lisää TheBox-tilisi";
"_login_url_"                   = "Palvelimen osoite https://...";
"_login_bottom_label_"          = "Eikö sinulla ole vielä palvelinta?\nValitse yksi palveluntarjoajista.";
"_error_multidomain_"           = "Osoite ei kelpaa, ainoastaan seuraavat verkkotunnukset ovat sallittuja:";
"_account_already_exists_"      = "Tunnus %@ on jo olemassa";

// Favorite

"_favorites_"                   = "Suosikit";
"_favorite_"                    = "Suosikki";
"_unfavorite_"                  = "Poista suosikeista";
"_no_files_uploaded_"           = "Ei tiedostoja lähetetty";
"_tutorial_favorite_view_"      = "Suosikeiksi merkitsemäsi tiedostot ja kansiot näkyvät tässä";
"_tutorial_offline_view_"       = "Files copied here will be available offline.\n\nThey will be synchronized with your cloud.";
"_tutorial_local_view_"         = "You'll find the unpacked files from your cloud.\n\nConnect to iTunes to share these files.";
"_more_"                        = "Lisää";
"_favorite_no_files_"           = "Ei vielä suosikkeja";


// Auto Upload

"_pull_down_"                               = "Vedä alaspäin päivittääksesi";
"_no_photo_load_"                           = "Ei kuva tai video";
"_tutorial_autoupload_view_"                = "You can enable auto uploads from \"Settings\"";
"_no_date_"                                 = "No date";
"_today_"                                   = "Tänään";
"_time_"                                    = "Aika: %@\n\n%@";
"_location_not_enabled_"                    = "Location Services not enabled";
"_location_not_enabled_msg_"                = "Please go to \"Settings\" and turn on \"Location Services\" to allow automatic photo/video uploads.";
"_access_photo_not_enabled_"                = "Access to Photos not enabled";
"_access_photo_not_enabled_msg_"            = "Please go to \"Settings\" and turn on \"Photo Access\" to allow automatic photo/video uploads.";
"_access_photo_location_not_enabled_"       = "Access to Photos and Location not enabled";
"_access_photo_location_not_enabled_msg_"   = "Please go to \"Settings\" and turn on \"Photo Access\" and \"Location Services\" to allow automatic photo/video uploads.";
"_tutorial_photo_view_"                     = "Ei lähetettyjä kuvia tai videoita";
"_create_full_upload_"                      = "Luodaan arkistoa... Tämä saattaa kestää kauan, ole hyvä ja odota.";
"_error_createsubfolders_upload_"           = "Virhe alikansioita luotaessa";
"_activate_autoupload_"                     = "Ota automaattinen lähetys käyttöön";

// Utility

"_never_"                       = "ei koskaan";
"_less_a_minute_"               = "alle minuutti sitten";
"_minutes_ago_"                 = "%d minuuttia sitten";
"_hours_ago_"                   = "%d tuntia sitten";
"_days_ago_"                    = "%d päivää sitten";
"_over_30_days_"                = "yli 30 päivää sitten";
"_connection_internet_offline_" = "The Internet connection appears to be offline or Wi-Fi is required";
"_insert_password_"             = "anna salasana";
"_update_in_progress_"          = "Versiopäivitys, ole hyvä ja odota...";
"_forbidden_characters_"        = "The file or folder name contains invalid characters";
"_mail_not_can_send_mail_"      = "No account set up, or wrong email address entered";

// File

"_photo_camera_"                = "Kuvat";
"_unzip_in_progress_"           = "Extraction in progress on local storage…";
"_file_unpacked_"               = "File unpacked on local storage";
"_file_saved_local_"            = "Tiedosto tallennettu paikalliseen muistiin.";
"_file_not_present_"            = "Virhe: Tiedostoa ei löydy, ole hyvä ja päivitä.";
"_order_by_date_"               = "Järjestä päiväyksen mukaan";
"_current_order_name_"          = "(lajiteltu nimen mukaan)";
"_order_by_name_"               = "Järjestä nimen mukaan";
"_current_order_date_"          = "(lajiteltu päivämäärän mukaan)";
"_sort_descending_"             = "Lajittele laskevasti";
"_current_sort_ascending_"      = "(lajiteltu nousevasti)";
"_sort_ascending_"              = "Lajittele nousevasti";
"_current_sort_descending_"     = "(lajiteltu laskevasti)";
"_delete_selected_files_"       = "Poista tiedostoja";
"_move_selected_files_"         = "Siirrä tiedostoja";
"_download_selected_files_"     = "Lataa tiedostoja";
"_download_selected_files_folders_" = "Lataa tiedostoja ja kansioita";
"_error_operation_canc_"        = "Virhe: Toiminto peruutettu.";
"_only_lock_passcode_"          = "Käytettävissä vain salasanasuojauksen ollessa käytössä. Ota suojaus käyttöön asetuksissa.";
"_passcode_protection_"         = "Salasanasuojaus";
"_remove_favorites_"            = "Poista suosikeista";
"_remove_offline_"              = "Remove from offline";
"_add_favorites_"               = "Lisää suosikkeihin";
"_add_offline_"                 = "Add to offline";
"_remove_passcode_"             = "Remove password protection";
"_protect_passcode_"            = "Suojaa salasanalla";
"_share_"                       = "Jaa";
"_reload_"                      = "Lataa uudelleen";
"_open_in_"                     = "Avaa kohteessa...";
"_remove_local_file_"           = "Poista välimuistista";
"_add_local_"                   = "Lisää paikalliseen muistiin";
"_comm_erro_pull_down_"         = "Attention: Communication error with the server. Pull down to refresh.";
"_file_not_downloaded_"         = "tiedostoa ei ole ladattu";
"_file_not_uploaded_"           = "tiedostoa ei ole lähetetty";
"_folders_"                     = "kansiot";
"_folder_"                      = "kansio";
"_files_"                       = "tiedostot";
"_file_"                        = "tiedosto";
"_folder_blocked_"              = "Kansio estetty";
"_downloading_progress_"        = "Aloitetaan tiedostojen lataamista...";
"_no_file_pull_down_"           = "Lähetä tiedosto tai vedä alas päivittääksesi";
"_browse_images_"               = "Selaa kuvia";
"_synchronized_folder_"         = "Pidä kansio synkronoituna";
"_remove_synchronized_folder_"  = "Turn off the synchronization";
"_synchronized_confirm_"        = "After enabling the synchronization, all files in the folder will be synchronized with the server, continue?";
"_offline_folder_confirm_"      = "After enabling the offline folder, all files in it will be synchronized with the server, continue?";
"_file_not_found_reload_"       = "Tiedostoa ei löytynyt, vedä alas päivittääksesi";
"_title_section_download_"      = "LATAA";
"_title_section_upload_"        = "LÄHETÄ";
"_group_alphabetic_yes_"        = "✓ Group alphabetically";
"_group_alphabetic_no_"         = "Group alphabetically";
"_group_typefile_yes_"          = "✓ Ryhmittele tiedostotyypin mukaan";
"_group_typefile_no_"           = "Ryhmittele tiedostotyypin mukaan";
"_group_date_yes_"              = "✓ Ryhmittele päiväyksen mukaan";
"_group_date_no_"               = "Ryhmittele päiväyksen mukaan";
"_element_"                     = "element";
"_elements_"                    = "elements";
"_tite_footer_upload_wwan_"     = "Wi-Fi-yhteys vaaditaan, %lu %@ lähetettävänä";
"_tite_footer_upload_"          = "%lu %@ lähetettävänä";
"_tite_footer_download_wwan_"   = "Wi-Fi-yhteys vaaditaan, %lu %@ ladattavana";
"_tite_footer_download_"        = "%lu %@ ladattavana";
"_limited_dimension_"           = "Maximum size reached";
"_save_selected_files_"         = "Save images and videos to photo album";
"_file_not_saved_cameraroll_"   = "Error: File not saved in photo album";
"_file_saved_cameraroll_"       = "File saved in photo album";
"_directory_on_top_yes_"        = "✓ Kansiot ensin";
"_directory_on_top_no_"         = "Kansiot ensin";
"_folder_automatic_upload_"     = "Folder for automatic upload";
"_search_no_record_found_"      = "Ei tuloksia";
"_search_in_progress_"          = "Haku käynnissä…";
"_search_instruction_"          = "Etsi tiedosto (vähintään 2 merkkiä)";
"_files_no_files_"              = "Täällä ei ole tiedostoja";

"audio"                         = "ÄÄNI";
"compress"                      = "PAKATUT";
"directory"                     = "KANSIOT";
"document"                      = "DOKUMENTIT";
"image"                         = "KUVAT";
"template"                      = "MALLIPOHJAT";
"unknow"                        = "TUNTEMATON";
"video"                         = "VIDEO";

"_file_del_only_local_"         = "File not present on server";

"_copy_file_"                   = "Kopioi tiedosto";
"_copy_files_"                  = "Kopioi tiedostot";
"_paste_file_"                  = "Liitä tiedosto";
"_paste_files_"                 = "Liitä tiedostoja";

"_search_this_folder_"          = "Etsi tästä kansiosta";
"_search_all_folders_"          = "Etsi kaikista kansioista";
"_search_sub_folder_"           = "Etsi täältä ja alikansioista";

"_theming_is_light_"            = "Server theming too brightly coloured, not applicable";

// Files Preview

"_insert_password_pfd_"         = "Suojattu PDF. Syötä salasana";
"_password_pdf_error_"          = "Väärä salasana";
"_error_download_photobrowser_" = "Error: Unable to download photo";

// Share

"_share_link_"                  = "Jaa linkki";
"_share_link_button_"           = "Lähetä linkki…";
"_password_"                    = "Salasana";
"_share_password_"              = "Salasanasuojattu linkki";
"_share_expirationdate_"        = "Aseta vanhenemispäivä linkille";
"_date_"                        = "Päiväys";
"_share_title_"                 = "Jaa";
"_add_sharee_"                  = "Lisää käyttäjiä tai ryhmiä";
"_add_sharee_footer_"           = "Voit jakaa tämän resurssin lisäämällä käyttäjiä tai ryhmiä. Poistaaksesi jaon, poista kaikki käyttäjät ja ryhmät";
"_find_sharee_title_"           = "Etsi";
"_find_sharee_"                 = "Etsi käyttäjä tai ryhmä…";
"_find_sharee_footer_"          = "Enter part of the name of the user or group to search for (at least 2 characters) followed by 'Return', select the users that should be allowed to access the share followed by 'Done' to confirm";
"_user_is_group_"               = "(ryhmä)";
"_direct_sharee_title_"         = "Jaa";
"_direct_sharee_footer_"        = "If you already know the name, enter it, then select the share type and press 'Done' to confirm";
"_direct_sharee_"               = "Anna käyttäjänimi…";
"_user_sharee_footer_"          = "Tap to change privileges";
"_share_type_title_"            = "Jaon tyyppi";
"_share_type_user_"             = "Käyttäjä";
"_share_type_group_"            = "Ryhmä";
"_share_type_remote_"           = "Etä";

// Share Permission

"_share_permission_title_"          = "Oikeudet";
"_share_permission_edit_"           = "Voi muokata";
"_share_permission_file_can_write_" = "Voi kirjoittaa tiedostoon";
"_share_permission_create_"         = "Voi luoda";
"_share_permission_create_file_"    = "Voi luoda tiedostoja";
"_share_permission_create_folder_"  = "Voi luoda kansioita";
"_share_permission_change_"         = "Voi vaihtaa";
"_share_permission_delete_"         = "Voi poistaa";
"_share_permission_share_"          = "Voi jakaa";
"_share_permission_rename_"         = "Voi uudelleennimetä";
"_share_permission_move_"           = "Voi siirtää";
"_share_permission_read_"           = "Voi lukea";
"_share_permission_info_"           = "Jakamisen tiedot";
"_share_permission_path_"           = "Tiedosto/Kansio";
"_share_permission_type_"           = "Tyyppi";
"_share_permission_typeuser_"       = "Käyttäjä";
"_share_permission_typegroup_"      = "Ryhmä";
"_share_permission_typepubliclink_" = "Linkki";
"_share_permission_typefederated_"  = "Federated";
"_share_permission_owner_"          = "Omistaja";
"_share_permission_date_"           = "Päiväys";
"_share_permission_email_"          = "Sähköposti-ilmoitus";

// ShareInfoCMOC

"_type_resource_connect_you_"       = "Jaettu kanssasi";
"_type_resource_external_"          = "Ulkoinen tallennustila";

// Share Ext

"_destiny_folder_"                  = "Kansio: %@";

"_no_transfer_"                     = "Ei siirtoja";
"_no_transfer_sub_"                 = "Tältä laitteelta suoritetut lähetykset ja lataukset näkyvät tässä";
"_no_activity_"                     = "Ei toimia vielä";
"_transfers_"                       = "Siirrot";
"_activity_"                        = "Toimet";
"_activity_file_not_present_"       = "Tiedostoa ei ole enää olemassa";

// List Shares

"_list_shares_"                     = "Jaot";
"_list_shares_no_files_"            = "Ei mitään jaettua";
"_tutorial_list_shares_view_"       = "Jakamasi tiedostot ja kansiot näkyvät tässä";

// Offline - Local Storage

"_create_synchronization_"          = "Create synchronization";
"_offline_"                         = "Offline";
"_local_storage_"                   = "Paikallinen tallennustila";
"_local_storage_no_record_"         = "Ei tiedostoja vielä";

// Create Cloud

"_upload_photos_videos_"            = "Lähetä kuvia tai vidoita";
"_upload_file_"                     = "Lähetä tiedosto";
"_upload_file_text_"                = "Luo tekstitiedosto";

// Document Picker

"_save_document_picker_"            = "Tallenna tänne";

// CreateFormUploadAssets

"_destination_folder_"              = "Kohdekansio";
"_use_folder_photos_"               = "Use the Photos folder as destination";
"_rename_filename_"                 = "Nimeä uudelleen";
"_filename_"                        = "Filename";
"_preview_filename_"                = "Example preview of filename. You can use the mask MM,MMM,DD,YY,YYYY and HH,hh,mm,ss,ampm for date/time";
"_forbidden_characters_"            = "The file or folder name contains invalid characters";
"_add_filenametype_"                = "Specify type in filename";
"_filenametype_photo_video_"        = "Kuva/video";

// Notification

"_notification_"                    = "Ilmoitus";

// Photo Browser

"Done"                              = "Valmis";
"Select Photos"                     = "Valitse kuvia";
"photo"                             = "kuva";
"photos"                            = "kuvaa";
"of"                                = "/";
"%i of %i"                          = "%1$i / %2$i";

// Manage Auto Upload FileName

"_autoupload_filename_title_"       = "Auto upload filename";

// Text File

"_untitled_txt_"                    = "Nimetön.txt";

// EndToEnd Encryption

"_e2e_settings_title_"              = "Salaus";
"_e2e_settings_"                    = "End-to-end encryption";
"_e2e_settings_start_"              = "Start end-to-end encryption";
"_e2e_settings_not_available_"      = "End-to-end encryption not available";
"_e2e_settings_activated_"          = "End-to-end encryption activated";
"_e2e_settings_view_passphrase_"    = "This 12 word phrase is a very strong password providing full access to view and use your encrypted files. Please write it down and keep it somewhere safe.";
"_e2e_settings_read_passphrase_"    = "Read passphrase";
"_e2e_settings_lock_not_active_"    = "Lock not active, go back to \"Settings\" and activate it";
"_e2e_settings_the_passphrase_is_"  = "The passphrase is:";
"_e2e_passphrase_request_title_"    = "Request passphrase";
"_e2e_passphrase_request_message_"  = "Insert the 12 words";
"_e2e_settings_remove_"             = "Remove the encryption locally";
"_e2e_settings_remove_message_"     = "Confirm removing encryption along with the passphrase.";
